frontend/controllers/NewsFlashController.php

    public function actionIndex()
    {


		if(Yii::$app->user->isGuest){
			return $this->redirect(['site/login']);
		}else{

			$query = Newsflash::find();

			$pagination = new Pagination([
				'defaultPageSize' => 10,
				'totalCount' => $query->count(),
---
SELECT COUNT(*) FROM `newsflash`

    public function actionCreate()
    {

		$model = new Newsflash();

		$model->user_id = Yii::$app->user->identity->id;
		$model->created_at = strtotime(date('d-m-Y H:i:s'));

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `newsflash` (`user_id`, `created_at`, `title`, `body`, `image`, `type`) VALUES (1, 1505135410, 'dsfdsfsdf', '<p>asdasd</p>\r\n', '', 1)