frontend/models/NewsflashQuery.php

SELECT * FROM `newsflash` ORDER BY `created_at` DESC
---
    public function all($db = null)
    {
        return parent::all($db);